Обработки/Reports/_РасчетДоходностиПоМетодикеПФР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_РасчетДоходностиПоМетодикеПФР</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоВводыВыводы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_РасчетДоходностиПоМетодикеПФР/Ext/ObjectModule.bsl
#Область Интерфейс_внешней_обработки

Функция СведенияОВнешнейОбработке() Экспорт
	                                                             
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет, 
		"Расчет доходности по методике ПФР", 
		"0.03", 
		"", 
		Истина);
		
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

#КонецОбласти

#Область ФормированиеОтчёта

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗаполнитьОтчет(ДокументРезультат, Ложь);
	
КонецПроцедуры

Процедура ЗаполнитьОтчет(ДокументРезультат, Отказ) 
	
#Область СтатистикаНачало
	Механизм	= ЭтотОбъект.Метаданные().ПолноеИмя() + "." + ЭтотОбъект.ВариантОтчета;
	Сессия		= ЗарегистрироватьСессиюСбораСтатистики(Механизм);
#КонецОбласти	

	ДокументРезультат.Очистить();

	Если ЭтотОбъект.ВариантОтчета = "ОтчетОбИзмененииДоходности" Тогда
		ЗаполнитьОтчетОбИзмененииДоходности(ДокументРезультат);
		
	ИначеЕсли ЭтотОбъект.ВариантОтчета = "СведенияОДоходностиИнвестированияСредствПенсионныхНакоплений" Тогда
		ЗаполнитьСведенияОДоходностиИнвестированияСредствПенсионныхНакоплений(ДокументРезультат, Отказ);
		
	КонецЕсли;
	
#Область СтатистикаКонец
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);	
#КонецОбласти	
	
КонецПроцедуры

Процедура ЗаполнитьОтчетОбИзмененииДоходности(ДокументРезультат)
	         	
	//ДнейВГоду = ДеньГода(КонецГода(ЭтотОбъект.Период.ДатаОкончания));
	ДнейВГоду = 365;  //  #534640
	ДатаНачалаРасчетаДоходности = ЭтотОбъект.Период.ДатаНачала;	
	
	Отчет = ПолучитьМакет(ЭтотОбъект.ВариантОтчета);

	ОбластьШапка	 = Отчет.ПолучитьОбласть("Шапка");
	ОбластьСтрока	 = Отчет.ПолучитьОбласть("Строка");
	ОбластьРезультат = Отчет.ПолучитьОбласть("Результат");
	ОбластьПодпись	 = Отчет.ПолучитьОбласть("Подпись");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
#Область ТекстЗапроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыОрганизации.КраткоеНаименованиеПоУставу КАК ДоверительныйУправляющий,
		|	СчетаДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	СчетаДоверительногоУправления.ДатаЗаключения КАК ДатаДоговора,
		|	ЕСТЬNULL(РеквизитыЮридическихЛицКлиента.КраткоеНаименованиеПоУставу, РеквизитыФизическихЛицКлиента.Фамилия + "" "" + ПОДСТРОКА(РеквизитыФизическихЛицКлиента.Имя, 1, 1) + "". "" + ПОДСТРОКА(РеквизитыФизическихЛицКлиента.Отчество, 1, 1) + ""."") КАК УчредительУправления,
		|	ЕСТЬNULL(ВводыВыводы.ДатаПервогоВвода, &ДатаНачала) КАК ДатаНачалаРасчетаДоходности
		|ПОМЕСТИТЬ _ДанныеШапки
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаОкончания, ) КАК КлиентДоверительногоУправления
		|		ПО СчетаДоверительногоУправления.Ссылка = КлиентДоверительногоУправления.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&ДатаОкончания,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыОрганизации
		|		ПО СчетаДоверительногоУправления.Организация.ЮрФизЛицо = РеквизитыОрганизации.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|				&ДатаОкончания,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицКлиента
		|		ПО (КлиентДоверительногоУправления.Клиент = РеквизитыФизическихЛицКлиента.ЮрФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&ДатаОкончания,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицКлиента
		|		ПО (КлиентДоверительногоУправления.Клиент = РеквизитыЮридическихЛицКлиента.ЮрФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			НАЧАЛОПЕРИОДА(МИНИМУМ(ВводыВыводыАктивовВВалютеУчета.Период), ДЕНЬ) КАК ДатаПервогоВвода
		|		ИЗ
		|			РегистрНакопления.ВводыВыводыАктивовВВалютеУчета КАК ВводыВыводыАктивовВВалютеУчета
		|		ГДЕ
		|			ВводыВыводыАктивовВВалютеУчета.Организация = &Организация
		|			И ВводыВыводыАктивовВВалютеУчета.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|			И ВводыВыводыАктивовВВалютеУчета.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|			И ВводыВыводыАктивовВВалютеУчета.ВидОперацииВводаВыводаДС В(&МассивВидыОпераций)) КАК ВводыВыводы
		|		ПО (ВводыВыводы.ДатаПервогоВвода >= &ДатаНачала)
		|ГДЕ
		|	СчетаДоверительногоУправления.Ссылка = &СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ФинансовыеПоказателиСрезПоследних.Период КАК Период,
		|	ФинансовыеПоказателиСрезПоследних.Значение КАК СЧА
		|ПОМЕСТИТЬ _СЧА
		|ИЗ
		|	РегистрСведений.ФинансовыеПоказатели.СрезПоследних(
		|			&ДатаНачала,
		|			Организация = &Организация
		|				И СубъектАналитики = &СчетДоверительногоУправления
		|				И ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок)) КАК ФинансовыеПоказателиСрезПоследних
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ФинансовыеПоказатели.Период,
		|	ФинансовыеПоказатели.Значение
		|ИЗ
		|	РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|ГДЕ
		|	ФинансовыеПоказатели.Организация = &Организация
		|	И ФинансовыеПоказатели.СубъектАналитики = &СчетДоверительногоУправления
		|	И ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок)
		|	И ФинансовыеПоказатели.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НАЧАЛОПЕРИОДА(ВводыВыводыАктивовВВалютеУчета.Период, ДЕНЬ) КАК Период,
		|	СУММА(ВЫБОР
		|			КОГДА ВводыВыводыАктивовВВалютеУчета.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|				ТОГДА ВводыВыводыАктивовВВалютеУчета.РыночнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Приход,
		|	СУММА(ВЫБОР
		|			КОГДА ВводыВыводыАктивовВВалютеУчета.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|				ТОГДА ВводыВыводыАктивовВВалютеУчета.РыночнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Расход
		|ПОМЕСТИТЬ _ВводыВыводы
		|ИЗ
		|	РегистрНакопления.ВводыВыводыАктивовВВалютеУчета КАК ВводыВыводыАктивовВВалютеУчета
		|ГДЕ
		|	ВводыВыводыАктивовВВалютеУчета.Организация = &Организация
		|	И ВводыВыводыАктивовВВалютеУчета.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ВводыВыводыАктивовВВалютеУчета.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ВводыВыводыАктивовВВалютеУчета.ВидОперацииВводаВыводаДС В(&МассивВидыОпераций)
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(ВводыВыводыАктивовВВалютеУчета.Период, ДЕНЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДатыПредыдущихСЧА.ДатаСЧА КАК ДатаСЧА,
		|	ДатыПредыдущихСЧА.ДатаПредыдущейСЧА КАК ДатаПредыдущейСЧА,
		|	ЕСТЬNULL(ФинансовыеПоказатели.Значение, 0) КАК ПредыдущаяСЧА
		|ПОМЕСТИТЬ _ПредыдущаяСЧА
		|ИЗ
		|	(ВЫБРАТЬ
		|		_СЧА.Период КАК ДатаСЧА,
		|		МАКСИМУМ(ФинансовыеПоказатели.Период) КАК ДатаПредыдущейСЧА
		|	ИЗ
		|		_СЧА КАК _СЧА
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|			ПО (ФинансовыеПоказатели.Организация = &Организация)
		|				И (ФинансовыеПоказатели.СубъектАналитики = &СчетДоверительногоУправления)
		|				И (ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
		|				И _СЧА.Период > ФинансовыеПоказатели.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_СЧА.Период) КАК ДатыПредыдущихСЧА
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|		ПО (ФинансовыеПоказатели.Организация = &Организация)
		|			И (ФинансовыеПоказатели.СубъектАналитики = &СчетДоверительногоУправления)
		|			И (ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
		|			И ДатыПредыдущихСЧА.ДатаПредыдущейСЧА = ФинансовыеПоказатели.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СЧА.Период КАК Период,
		|	ЕСТЬNULL(_ВводыВыводы.Приход, 0) КАК Приход,
		|	ЕСТЬNULL(_ВводыВыводы.Расход, 0) КАК Расход,
		|	ВЫБОР
		|		КОГДА _ПредыдущаяСЧА.ПредыдущаяСЧА = 0
		|			ТОГДА ЕСТЬNULL(_ВводыВыводы.Приход, 0) - ЕСТЬNULL(_ВводыВыводы.Расход, 0)
		|		ИНАЧЕ _СЧА.СЧА
		|	КОНЕЦ КАК СЧА,
		|	ЕСТЬNULL(_ВводыВыводы.Приход, 0) - ЕСТЬNULL(_ВводыВыводы.Расход, 0) КАК РазницаВВ,
		|	ВЫБОР
		|		КОГДА _ПредыдущаяСЧА.ПредыдущаяСЧА = 0
		|			ТОГДА 0
		|		ИНАЧЕ _СЧА.СЧА - (ЕСТЬNULL(_ВводыВыводы.Приход, 0) - ЕСТЬNULL(_ВводыВыводы.Расход, 0))
		|	КОНЕЦ КАК СЧАдляРасчета,
		|	_ПредыдущаяСЧА.ПредыдущаяСЧА = 0 КАК ПредыдущаяСЧАРавна0
		|ПОМЕСТИТЬ _ДанныеОтчета
		|ИЗ
		|	_СЧА КАК _СЧА
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВводыВыводы КАК _ВводыВыводы
		|		ПО _СЧА.Период = _ВводыВыводы.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПредыдущаяСЧА КАК _ПредыдущаяСЧА
		|		ПО _СЧА.Период = _ПредыдущаяСЧА.ДатаСЧА
		|ГДЕ
		|	(НЕ &ТолькоВводыВыводы
		|			ИЛИ НЕ _ВводыВыводы.Период ЕСТЬ NULL
		|			ИЛИ _СЧА.Период <= &ДатаНачала
		|			ИЛИ РАЗНОСТЬДАТ(_СЧА.Период, &ДатаОкончания, ДЕНЬ) = 0)";
#КонецОбласти
	
	МассивВидыОпераций = Новый Массив;
	МассивВидыОпераций.Добавить(Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОтУчредителяВДоверительноеУправление);
	МассивВидыОпераций.Добавить(Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратДенежныхСредствУчредителюПоДоверительномуУправлению);
	МассивВидыОпераций.Добавить(Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОтПФР);
	МассивВидыОпераций.Добавить(Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ВыводДляОбеспеченияИОУД);
	МассивВидыОпераций.Добавить(Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ВыплаченыСредстваПФР);
	МассивВидыОпераций.Добавить(Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ВыводУчредителюДоходаПолученногоОтРазмещения);
	МассивВидыОпераций.Добавить(Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПрочиеВводы);
	МассивВидыОпераций.Добавить(Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПрочиеВыводы);
	МассивВидыОпераций.Добавить(Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПустаяСсылка());
	
	Запрос.УстановитьПараметр("МассивВидыОпераций"	, МассивВидыОпераций);	
	
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Организация"					, ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ДатаНачала"					, ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания"				, ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ТолькоВводыВыводы"			, ЭтотОбъект.ТолькоВводыВыводы);
	
	Запрос.Выполнить();
	
	
	//шапка
	ДанныеШапки = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ДанныеШапки").ПолучитьДанные().Выбрать();
	Если ДанныеШапки.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, ДанныеШапки);
		
		ОбластьШапка.Параметры.ДатаДоговора	= Формат(ДанныеШапки.ДатаДоговора, "ДФ=dd.MM.yyyy");
		ОбластьШапка.Параметры.ПериодОтчета	= ПредставлениеПериода(ЭтотОбъект.Период.ДатаНачала, ЭтотОбъект.Период.ДатаОкончания, "ФП=Истина");	
		
		ДатаНачалаРасчетаДоходности = ДанныеШапки.ДатаНачалаРасчетаДоходности;
	КонецЕсли;
	
	ДокументРезультат.Вывести(ОбластьШапка);
	
	//отчет
	ДанныеОтчета = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ДанныеОтчета").ПолучитьДанные().Выгрузить();
	ДанныеОтчета.Сортировать("Период");
	
	СЧАвчерашнее = 0; Произведение = 1;
	Для Каждого СтрокаДанных Из ДанныеОтчета Цикл	
		Если СЧАвчерашнее = 0 Тогда 
			СЧАвчерашнее = СтрокаДанных.СЧА;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, СтрокаДанных);
		
		Если СЧАвчерашнее <> 0 Тогда 
			Доходность	 = СтрокаДанных.СЧАдляРасчета/СЧАвчерашнее;
			Произведение = Произведение * Доходность;
		Иначе
			Доходность	 = 0;
		КонецЕсли;
		
		Если Доходность = 0 Тогда
			Произведение = 1;
	    КонецЕсли;

		ОбластьСтрока.Параметры.Доходность = Доходность;
		
		ДокументРезультат.Вывести(ОбластьСтрока);
		СЧАвчерашнее = СтрокаДанных.СЧА;
		
	КонецЦикла;	
	
	//расчет доходности 
	ДлительностьПериода = (КонецДня(ЭтотОбъект.Период.ДатаОкончания) + 1 - ДатаНачалаРасчетаДоходности)/24/60/60;
	ДоходностьПериода	= (Произведение-1)*ДнейВГоду/ДлительностьПериода*100;
	
	Расшифровка = "(" + Формат(Произведение, "ЧДЦ=10") + " - 1)*100*"+ДнейВГоду+"/"+ДлительностьПериода + " = ";
	
	ОбластьРезультат.Параметры.ДоходностьПериода = ДоходностьПериода;
	ОбластьРезультат.Параметры.Расшифровка = Расшифровка;
	
	ДокументРезультат.Вывести(ОбластьРезультат);
	
	ОбластьПодпись.Параметры.Заполнить(ПолучитьПараметрыВыводаПодписей());
	ДокументРезультат.Вывести(ОбластьПодпись);
	
	ДокументРезультат.ФиксацияСверху = 9;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОДоходностиИнвестированияСредствПенсионныхНакоплений(ДокументРезультат, Отказ)
	
	Макет = ПолучитьМакет(ЭтотОбъект.ВариантОтчета);
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ДатаОкончания",					ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация",					ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	ЭтотОбъект.СчетДоверительногоУправления);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	СчетаДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключения,
		|	ЕСТЬNULL(РеквизитыЮридическихЛицАнкетныеСрезПоследних.ПолноеНаименованиеПоУставу, РеквизитыФизическихЛицАнкетныеСрезПоследних.Фамилия + "" "" + РеквизитыФизическихЛицАнкетныеСрезПоследних.Имя + "" "" + РеквизитыФизическихЛицАнкетныеСрезПоследних.Отчество) КАК ПолноеНаименованиеКлиента,
		|	&ДатаОкончания КАК ДатаОкончания,
		|	ФинансовыеПоказатели.Значение КАК СЧА,
		|	ВЫБОР
		|		КОГДА КлиентыДоверительногоУправленияСрезПоследних.Клиент.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ЮридическоеЛицо)
		|			ТОГДА ""Полное наименование Фонда:""
		|		ИНАЧЕ ""Учредитель доверительного управления:""
		|	КОНЕЦ КАК ПредставлениеУчредителяУправления
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаОкончания, Организация = &Организация) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ПО СчетаДоверительногоУправления.Ссылка = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&ДатаОкончания,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
		|		ПО (КлиентыДоверительногоУправленияСрезПоследних.Клиент = РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|		ПО СчетаДоверительногоУправления.Ссылка = ФинансовыеПоказатели.СубъектАналитики
		|			И (ФинансовыеПоказатели.Организация = &Организация)
		|			И (ФинансовыеПоказатели.Период = НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ))
		|			И (ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|				&ДатаОкончания,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
		|		ПО (КлиентыДоверительногоУправленияСрезПоследних.Клиент = РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо)
		|ГДЕ
		|	СчетаДоверительногоУправления.Ссылка = &СчетДоверительногоУправления";
	
	РеквизитыШапки = Запрос.Выполнить().Выбрать();
	РеквизитыШапки.Следующий();
	
	Если РеквизитыШапки.СЧА = Null Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("По счёту %1 не зарегистрирована СЧА на %2", ЭтотОбъект.СчетДоверительногоУправления, Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ=dd.MM.yyyy")),,,, Отказ);
	ИначеЕсли РеквизитыШапки.ПолноеНаименованиеКлиента = Null Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("По счёту %1 не зарегистрирована анкета клиента на %2", ЭтотОбъект.СчетДоверительногоУправления, Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ=dd.MM.yyyy")),,,, Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ДокументРезультат.Вывести(РаботаСОтчетами.ПолучитьШапкуОфициальногоБланкаОрганизации(ЭтотОбъект.Организация, ЭтотОбъект.Период.ДатаОкончания));	
	
	ЗаполнитьЗначенияСвойств(Макет.Параметры, РеквизитыШапки, "НомерДоговора, ПолноеНаименованиеКлиента, СЧА, ПредставлениеУчредителяУправления");
	
	Макет.Параметры.ДатаЗаключения = Формат(РеквизитыШапки.ДатаЗаключения, "ДФ='dd MMMM yyyy ""г.""'");
	Макет.Параметры.ДатаОкончания  = Формат(РеквизитыШапки.ДатаОкончания, "ДФ='«dd» MMMM yyyy ""г.""'");
	
	ФинансовыеПоказатели = Документы.РегистрацияСтоимостиАктивов.РассчитатьДоходностьИнвестированияПФР(ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Период.ДатаОкончания);
	
	Макет.Параметры.ДоходностьПФРТекущегоГода	 = ФинансовыеПоказатели.Получить(Справочники.ВидыФинансовыхПоказателей.ДоходностьПФРТекущегоГода);
	Макет.Параметры.ДоходностьПФРПредыдущегоГода = ФинансовыеПоказатели.Получить(Справочники.ВидыФинансовыхПоказателей.ДоходностьПФРПредыдущегоГода);
	
	Макет.Параметры.Заполнить(ПолучитьПараметрыВыводаПодписей());
	
	ДокументРезультат.ПолеСлева				= 22.5;
	ДокументРезультат.ПолеСправа			= 5;
	
	ДокументРезультат.АвтоМасштаб			= Истина;
	ДокументРезультат.КлючПараметровПечати	= ЭтотОбъект.ВариантОтчета;
	ДокументРезультат.ОтображатьСетку		= Ложь;
	ДокументРезультат.ОтображатьЗаголовки	= Ложь;
	ДокументРезультат.ТолькоПросмотр		= Истина;
	
	ДокументРезультат.Вывести(Макет);

КонецПроцедуры

#КонецОбласти

#Область Подписи

Функция ПолучитьПараметрыВыводаПодписей()

	СтруктураКлюча = Новый Структура;
	СтруктураКлюча.Вставить("Подразделение", ПредопределенноеЗначение("Справочник.Подразделения.ГруппаКомпаний"));
	СтруктураКлюча.Вставить("Язык", ПредопределенноеЗначение("Справочник.Языки.Русский"));
	СтруктураКлюча.Вставить("Объект", ЭтотОбъект.Организация);
	СтруктураКлюча.Вставить("КонтактноеЛицо", ЭтотОбъект.Подписант);
	
	СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(СтруктураКлюча);
	
	ПараметрыВыводаПодписей = Новый Структура;
	
	Если ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
		ПараметрыВыводаПодписей.Вставить("ФИОРуководителя",			СтруктураДанныхКонтактногоЛица.КонтактноеЛицо);
		ПараметрыВыводаПодписей.Вставить("ДолжностьРуководителя", 	СтруктураДанныхКонтактногоЛица.Должность);	
	КонецЕсли; 
	
	Возврат ПараметрыВыводаПодписей;

КонецФункции
	
#КонецОбласти

#Область ДополнительныеФункции

Функция ЗарегистрироватьСессиюСбораСтатистики(Механизм)
	
	СвойстваОбъекта = "Организация, СчетДоверительногоУправления, Период, ТолькоВводыВыводы, Подписант";
	
	ПараметрыВыполнения = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, СвойстваОбъекта);
	
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Механизм, ПараметрыВыполнения.Хранилище, ПараметрыВыполнения.Описание);
	
	Возврат Сессия;
	
КонецФункции

#КонецОбласти

#Область Автоматизация_формирования_отчета

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт

	Отказ = Ложь;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета,, "ВариантОтчета");
	ЭтотОбъект.ВариантОтчета = РаботаСОтчетами.ПолучитьСвойстваВариантаОтчета(НастройкиОтчета.ВариантОтчета).ИмяПредопределенногоВарианта;
	
	Если НастройкиОтчета.Свойство("Подписант")
		И ТипЗнч(НастройкиОтчета.Подписант) = Тип("Структура")
		И НастройкиОтчета.Подписант.Свойство("КонтактноеЛицо")
	Тогда
		ЭтотОбъект.Подписант = НастройкиОтчета.Подписант.КонтактноеЛицо;	
	КонецЕсли;
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	ЗаполнитьОтчет(ДокументРезультат, Отказ);
	
	Если Отказ Тогда
		ВызватьИсключение СтрСоединить(ПолучитьСообщенияПользователю(), Символы.ПС);
	КонецЕсли;
	
	НастройкиОтчета.Вставить("Результат", ДокументРезультат);
	
КонецПроцедуры

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	
	Настройки.Добавить("Подписант");
	Настройки.Добавить("ВариантОтчета");
	
	Возврат Настройки;

КонецФункции

#КонецОбласти
